function [ U, u,  E ] = ErrorSolutionf( h, ts, c,q)
%-----------------------------------偏微分方程的空间参数赋值-------------------------------
xl=-40;                                                                    %空间变量左端 
xr=60;                                                                    %空间变量右端点
L=xr-xl;                                                                 %空间变量x的区间长度
%h=0.1;                                                                  %空间步长
J=L/h;                                                                   %将区间[xl,xr]进行J等分
%--------------------------------—-偏微分方程的时间参数赋值-------------------------------
T1=0;                                                                    %时间变量的左端点
T2=10;                                                                    %时间变量的右端点
T=T2-T1;                                                                 %时间变量t的区间长度
%ts=0.1;                                                                 %时间步长
N=T/ts;                                                                  %将区间[T1,T2]进行N等分
%-----------------------------------偏微分方程精确解的参数赋值-----------------------------
x=xl+h:h:xr;                                                           %J-1维的行向量,以空间步长h进行递增
x=x';
t=T1:ts:T2;
X = repmat(x, 1, N+1);  %将列向量x在列的方向上扩充为N+1列
X=double(X);
T = repmat(t, J, 1);  %将行向量t在行的方向上扩充为J-1行
T=double(T);
u=3*c*(sech(0.5*sqrt(c/(q+q*c))*(X-(c+1)*T))).^2;
u0=u(:,1);                                    %微分方程在t=0时的解，
U0=u0;                                                                   %t=0时刻，微分方程的解等于数值解%右边界等于零                             
%----------------------------------------构造矩阵--------------------------------------
a=ones(J,1);                                                           %J-1行1列的全1阵
I=spdiags(a,0,J,J);                                                              %J-1阶的单位阵
%----------------------------------------算子矩阵---------------------------------------
T3 = Toeplitz(J, 0, 1, -1);
T2 = Toeplitz(J, 1, -1, 0);
T1 = Toeplitz(J, 1, 0, -1);
T4 = -Toeplitz(J, 0, 0, -1)^2+Toeplitz(J, 0, 1, 0)^2;
A1=(1/h)*T1;                                %1阶紧致算子矩阵                        
A2=(1/h)*T2;                           %1阶中心差分算子
A3=(1/(2*h))*T3;
A4=(1/4)*T4;
%--------------------------------格式迭代时的系数------------------------------------------
C0=I-q*4/3*A1*A2+q/3*A3*A3;%差分格式关于t的导数项的矩阵系数
C1=C0\I;
%----------------------编写差分格式的程序进行迭代---------------------
U=zeros(J,N+1); 
U(:,1)=U0;
U(:,2)=u(:,2);
for n=2:N
    U2=U(:,n);
    U1=U(:,n-1);
    U0=U1;
    U12=U0-2*ts*C1*(2/3*A3*(U2+U0)-1/6*A4*(U2+U0)+2/9*(U1.*(A3*(U2+U0))+A3*(U1.*(U2+U0)))-1/18*(U1.*(A4*(U2+U0))+A4*(U1.*(U2+U0))));
    U11=U2;
    while norm(U12-U11)>10^-13
        U11=U12;
        U12=U0-2*ts*C1*(2/3*A3*(U11+U0)-1/6*A4*(U11+U0)+2/9*(U1.*(A3*(U11+U0))-A3*(U1.*(U11+U0)))-1/18*(U1.*(A4*(U11+U0))+A4*(U1.*(U11+U0))));
    end
    U(:,n+1)=U12;
end

%-----------------------------------------能量-------------------------------------
%-------------------------------------数值解的能量---------------------------------
E=zeros(1,N+1);
for i=1:N+1
    %E(1,i)=h*(norm(U(:,i)))^2+h*(norm(E1*B1*U(:,i)))^2;
    %E(1,i)=h*(sum(U(:,i).^2))+h*sum((E1*B1*U(:,i)).^2);
    %E(1,i)=3*h*(sum(U(:,i).^2))+h*(sum(U(:,i).^3));
    E(1,i)=h*(sum(U(:,i)));
end
%-----------------------------------------误差无穷范数-------------------------------------
