function [ U, u,  E ] = ErrorSolution3( h, ts, c,q)
%-----------------------------------偏微分方程的空间参数赋值-------------------------------
xl=-50;                                                                    %空间变量左端 
xr=50;                                                                    %空间变量右端点
L=xr-xl;                                                                 %空间变量x的区间长度
%h=0.1;                                                                  %空间步长
J=L/h;                                                                   %将区间[xl,xr]进行J等分
%--------------------------------—-偏微分方程的时间参数赋值-------------------------------
T1=0;                                                                    %时间变量的左端点
T2=20;                                                                    %时间变量的右端点
T=T2-T1;                                                                 %时间变量t的区间长度
%ts=0.1;                                                                 %时间步长
N=T/ts;                                                                  %将区间[T1,T2]进行N等分
%-----------------------------------偏微分方程精确解的参数赋值-----------------------------
x=xl+h:h:xr;                                                           %J-1维的行向量,以空间步长h进行递增
x=x';
t=T1:ts:T2;
X = repmat(x, 1, N+1);  %将列向量x在列的方向上扩充为N+1列
X=double(X);
T = repmat(t, J, 1);  %将行向量t在行的方向上扩充为J-1行
T=double(T);
u=3*c*(sech(0.5*sqrt(c/(q+q*c))*(X-(c+1)*T))).^2;
u0=u(:,1);                                    %微分方程在t=0时的解，
U0=u0;                                                                   %t=0时刻，微分方程的解等于数值解%右边界等于零                             
%----------------------------------------构造矩阵--------------------------------------
a=ones(J,1);                                                           %J-1行1列的全1阵
I=spdiags(a,0,J,J);                                                              %J-1阶的单位阵
%----------------------------------------算子矩阵---------------------------------------
T1 = Toeplitz(J, 4, 1, 1);
T2 = Toeplitz(J, 0, 1, -1);
T3 = Toeplitz(J, -2, 1, 1);
T4 = Toeplitz(J, 10, 1, 1);
A1=(1/6)*T1;                                %1阶紧致算子矩阵                        
B1=(1/(2*h))*T2;                           %1阶中心差分算子
B2=(1/(h*h))*T3;
A2=(1/12)*T4;
%------------------------------------------------------------------------------------------  
D1=A1\B1;                                                              %B2=B21,其中2阶中心差分算子矩阵B2=1阶向前差分算子M1*1阶向后差分算子M2
D2=D1*D1;
D3=A2\B2;
k1=2/3;                                                                  %格式非线性项的系数
k2=1/3;                                                                  %格式非线性项的系数
%--------------------------------格式迭代时的系数------------------------------------------
C0=I-q*D3;                                                          %差分格式关于t的导数项的矩阵系数
C1=(C0\D1)*ts*0.5;                                              %系数
C2=(C0\D1)*ts*k1*0.125;
C3=(C0\I)*ts*k2*0.25;                                              %格式非线性项中的u^2*D1*u的系数'
%----------------------编写差分格式的程序进行迭代---------------------
U=zeros(J,N+1); 
U(:,1)=U0;
for n=1:N
    U1=U(:,n);
    U0=U(:,n);
    U12=U0-C1*(U1)-C2*(U1).^2-C3*((U1).*(D1*(U1)));
    U11=U1;
    while norm(U12-U11)>10^-13
        U11=U12;
        U12=U0-C1*(U11+U0)-C2*(U11+U0).^2-C3*((U11+U0).*(D1*(U11+U0)));
    end
    U(:,n+1)=U12;
end

%-----------------------------------------能量-------------------------------------
%-------------------------------------数值解的能量---------------------------------
E1=A1\I;
E=zeros(1,N+1);
for i=1:N+1
    %E(1,i)=h*(norm(U(:,i)))^2+h*(norm(E1*B1*U(:,i)))^2;
    %E(1,i)=h*(sum(U(:,i).^2))+h*sum((E1*B1*U(:,i)).^2);
    E(1,i)=h*sum(U(:,i))+h*sum((E1*B1*U(:,i)));
end
%-----------------------------------------误差无穷范数-------------------------------------
