function [ U, R, E ] = Solution( h, ts, c, p, q )
%-----------------------------------偏微分方程的空间参数赋值-------------------------------
xl=-20;                                                                    %空间变量左端 
xr=20;                                                                    %空间变量右端点
L=xr-xl;                                                                 %空间变量x的区间长度
%h=0.1;                                                                  %空间步长
J=L/h;                                                                   %将区间[xl,xr]进行J等分
%--------------------------------—-偏微分方程的时间参数赋值-------------------------------
T1=0;                                                                    %时间变量的左端点
T2=5;                                                                    %时间变量的右端点
T=T2-T1;                                                                 %时间变量t的区间长度
%ts=0.1;                                                                 %时间步长
N=T/ts;                                                                  %将区间[T1,T2]进行N等分
%-----------------------------------偏微分方程精确解的参数赋值-----------------------------
x=xl+h:h:xr;                                                           %J-1维的行向量,以空间步长h进行递增
x=x';
t=T1:ts:T2;
a=ones(J,1);
X = repmat(x, 1, N+1);  %将列向量x在列的方向上扩充为N+1列
T = repmat(t, J, 1);  %将行向量t在行的方向上扩充为J-1行
u=3*(c^2-1)/c*(sech(sqrt(c^2-1)/(2*c)*(X-c*T)).^2);
r=3*(c^2-1)/(c^2)*(sech(sqrt(c^2-1)/(2*c)*(X-c*T)).^2);
u0=3*(c^2-1)/c*(sech(sqrt(c^2-1)/(2*c)*x).^2);                           %微分方程在t=0时的解，
r0=3*(c^2-1)/(c^2)*(sech(sqrt(c^2-1)/(2*c)*x).^2);
%u0=(5/2)*(sech((sqrt(5)/6)*x)).^2;
%r0=(5/3)*(sech((sqrt(5)/6)*x)).^2;
U0=u0;                                                                   %t=0时刻，微分方程的解等于数值解
R0=r0;
ul=0;                                                                    %左边界等于零
ur=0;                                                                    %右边界等于零                             
%----------------------------------------构造矩阵--------------------------------------
a=ones(J,1);                                                           %J-1行1列的全1阵
b=zeros(J,1);                                                          %J-1行1列的零阵
I=spdiags(a,0,J,J);                                                  %J-1阶的单位阵
%----------------------------------------算子矩阵---------------------------------------
T1 = Toeplitz(J, 4, 1, 1);
T2 = Toeplitz(J, 10, 1, 1);
T3 = Toeplitz(J, 0, 1, -1);
T4 = Toeplitz(J, -2, 1, 1);
T5 = Toeplitz(J, -1, 1, 0);
T6 = Toeplitz(J, 1, 0, -1);
A1=(1/6)*T1;                                %1阶紧致算子矩阵
A2=(1/12)*T2;                              %2阶紧致算子矩阵
B1=(1/(2*h))*T3;                           %1阶中心差分算子
B2=(1/h^2)*T4;                          %2阶中心差分算子
M1=(1/(h))*T5;                             %1阶向前差分算子
M2=(1/(h))*T6;                             %1阶向后差分算子
%------------------------------------------------------------------------------------------ 
B2=M1*M2;                                                               %B2=B21,其中2阶中心差分算子矩阵B2=1阶向前差分算子M1*1阶向后差分算子M2
D1=A1\B1;                                                                %格式构造时出现的系数矩阵 A1的逆乘以B1
D2=A2\B2;                                                                %格式构造时出现的系数矩阵 A2的逆乘以B2
k1=2/3;                                                                  %格式非线性项的系数
k2=1/3;                                                                  %格式非线性项的系数
%--------------------------------格式迭代时的系数------------------------------------------
C0=I-D2;                                                          %差分格式关于t的导数项的矩阵系数
C1=(C0\D1)*ts*1/2;                                              %系数
C2=-(C0\(D2))*ts*p*1/2;                                                    %格式非线性项中的3次幂系数
C3=(C0\D1)*ts*k1*1/8;
C4=(C0\I)*ts*k2*1/4;                                                     %格式非线性项中的u^2*D1*u的系数
C5=D1*ts*1/2;
C6=q*ts*1/2;
%----------------------编写差分格式的程序进行迭代---------------------
U1=ones(J,1);                                                         %迭代公式里面的初值，是一个J-1行1列的零阵
U=zeros(J,N+1);                                                        %数值解为J-1行N+1列
R1=ones(J,1);
R=zeros(J,N+1);    
U(:,1)=U0;                                                               %将U0赋给矩阵U的第一列
U(:,2)=U1;                                                               %将U1赋给矩阵U的第二列
R(:,1)=R0;
R(:,2)=R1;
for n=1:N
    U11=U0-C1*(R1+R0)-C2*(U1+U0)-C3*(U1+U0).^2-C4*((U1+U0).*(D1*(U1+U0)));
	R11=R0-C5*(U0+U1)-C6*(R0+R1);
    U12=U11;
    U11=U1;
	R12=R11;
	R11=R1;
    while norm(U12-U11)+norm(R12-R11)>10^-13
        U11=U12;
		R11=R12;
        U12=U0-C1*(R11+R0)-C2*(U11+U0)-C3*(U11+U0).^2-C4*((U11+U0).*(D1*(U11+U0)));
		R12=R0-C5*(U0+U11)-C6*(R0+R11);
        end   
    U(:,n+1)=U12;
	R(:,n+1)=R12;
    U0=U12;
	R0=R12;
end

%-----------------------------------------能量-------------------------------------
%-------------------------------------数值解的能量---------------------------------
E=zeros(1,N+1);
for i=1:N+1
E(1,i)=h*(norm(U(:,i)))^2+h*(norm(D1*U(:,i)))^2+h*(norm(R(:,i)))^2;
end